#+TITLE: Projects

#+BEGIN: clocktable :scope file :maxlevel 3
#+CAPTION: Clock summary at [2022-06-28 Tue 08:07]
| Headline                                 | Time    |       |       |
|------------------------------------------+---------+-------+-------|
| *Total time*                             | *22:46* |       |       |
|------------------------------------------+---------+-------+-------|
| Print Farm [0/3]                         | 22:46   |       |       |
| \_  [2/3]                                |         | 22:46 |       |
| \_    Design mag joints for new extruder |         |       | 22:46 |
#+END:

* Farm
** TODO Plant remaining towers
SCHEDULED: <2023-04-01 Sat>
* Shop
** TODO Finalize shop name
** TODO Picture for Shop
** TODO Design logo
** TODO Buy shipping boxes
** TODO Create instagram account
** TODO Youtube account
** TODO Twitter account
* Foam Generator
** WAIT Foam generator
** WAIT V2 design foam generator design
First need to design a foaming straw.
* Suction cup shower planter
* Smoothing chamber
** DONE Make screw on lid for chamber
SCHEDULED: <2023-02-13 Mon>
** DONE Make lid for big chamber
** DONE Design smoothing reservoir
SCHEDULED: <2022-12-18 Sun>
** DONE print smoothing reservoir (PETG)
** DONE Buy extra large container
* Vertical Hydroponic Tower [20/24]
** TODO film new how-to video
SCHEDULED: <2023-02-20 Mon>
** TODO Higher infill density for main segments.
SCHEDULED: <2023-02-20 Mon>
** TODO Handle grips for tower base
** TODO Full tower from zero in 1 day
1. Print Tower base, spacer-segment, 6 segments, ultrasonic segment, lid, drip screws, plug.
2. Apply ABS paste to all segments as necessary.
3. Sand all segments.
4. Test for good fit (sand as needed).
5. Smooth all components.
6. Paint all segments.
7. Test with all components installed.
   ** DONE Print a tower base
** DONE Take photos with plants
SCHEDULED: <2023-02-20 Mon>
** DONE Make new Etsy listing
SCHEDULED: <2023-02-20 Mon>
** DONE hole for ultrasonic cable in spacer segment
SCHEDULED: <2023-02-15 Wed>
** DONE Ensure enough room for ultrasonic cable.
SCHEDULED: <2023-02-13 Mon>
** DONE Splash guard ultrasonic lid
SCHEDULED: <2023-02-13 Mon>
** DONE Visual indication of full twist
SCHEDULED: <2023-02-13 Mon>
** DONE Make plug slightly smaller
SCHEDULED: <2023-02-13 Mon>
** KILL Make a white spray painted model
** DONE Brass coat one dripper tower
SCHEDULED: <2022-12-12 Mon>
- [X] Make powder coating nozzle for caulk tubes
- [X] Finish up all segments with pen/iron
- [X] Seal each segment
- [X] Smooth all segments
- [X] Test all segments for fit
- [X] Powder coat each segment with nozzle
- [X] interior coat each segment
- [X] Polish each segment
- [X] Buy acrylic sealer
- [X] Apply acrylic sealer
** DONE Redo dripper segment with larger channels
SCHEDULED: <2023-01-24 Tue>
** DONE Pure white ABS tower
SCHEDULED: <2023-01-11 Wed>
- [ ] Finish printing final segments
- [ ] Sand dirty spots
- [ ] Smooth again
- [ ] Test all segments for quality fit
- [ ] Print new drip knobs
** DONE Pump for acetone sprayer
** DONE Hack ultrasonic smoothing chamber to work with 20mm fan
** DONE Apply PP shrinkwrap to protect ultrasonic cable
** DONE Start a smoothing job with all segments
** DONE Buy hammered metal paint
** DONE Paint all segments
** DONE Finish design of new fogger segment
** DONE Print new fogger segment
** DONE Print drip screws

* Ultrasonic window seeding tray
** WAIT simple round, stackable model today
** WAIT Sample hangable model
* Ultrasonic acetone smoothing
** DONE test the metal ultrasonics with acetone
* 5 gallon bucket tower
* Stacked towers
** DONE circumradius squares
** TODO Stacked rectangles fountain.
* 6 Pod hydroponic Tower
** TODO offseting
** TODO sloping
** TODO Test print
** TODO Finish latch
** DONE Center shape
** DONE Correct rough 3D geomety
** DONE Latch mechanisms
* Telescoping Tower
** TODO Bigger latch offsets
** TODO Design fogger segment
** TODO Tower top cone segment
** DONE N-pod design
** DONE Curved corners
** DONE wave pattern to absorb warp
** DONE Net cup offsets to fit standard square net cups
Top exterior: 57x57mm / 2.24x2.24in
Top interior: approx. 43x43mm / 1.7x1.7in
Bottom: approx. 37x37mm / 1.5x1.5in
Height: 35mm / 1.38in
** DONE Fish-scale latch
- [ ] Parameterize
  - scale-length
  - scale-offset
  - n-scales
** DONE Fix corners
** DONE Smooth transition for corner edges
** KILL Make curvature a function of width (ratio)
** DONE Design bottom segment
** DONE Add drip holes
** DONE Test layered printing
* Translucent single fog plant tower
** TODO round two
- Fogger hole
- Seal
- Wider base?
- Root guard (0.4mm printer)
- Float
- Black ASA base
* Suction cup tower / herb garden
* Magnetic window planter
** WAIT magnetic window model today
* Spiralized hydroponic Tower
** TODO Design ultrasonic float
SCHEDULED: <2023-02-25 Sat>
** DONE Spacer segment
SCHEDULED: <2022-11-30 Wed>
** DONE Put a tower on etsy
SCHEDULED: <2022-11-30 Wed>
** DONE Finish design of top
SCHEDULED: <2022-11-28 Mon>
** DONE design ultrasonic segment
SCHEDULED: <2022-11-28 Mon>
** DONE Increase height of base
** DONE Print Top, base
SCHEDULED: <2022-11-28 Mon>
* Print Farm [6/8]
** TODO cleanup farm
** TODO Upgrade kosssel 5 to new extruder
** DONE Cleanup farm
SCHEDULED: <2023-02-20 Mon>
** DONE Install vent fan
SCHEDULED: <2023-02-20 Mon>
** DONE Cleanup/re-org
SCHEDULED: <2023-01-10 Tue>
*** DONE Patio Cleanup
- [X] graffiti remover
- [X] Assemble all hydroponic towers
- [ ] Throw away rest of waste plastic
- [X] Move solar panel array
- [X] Move tables
- [X] Renew dishwasher ad
- [X] Clean food cabinet
- [X] Ad for food cabinet
*** DONE Grow room setup
- [X] Cut plastic roof
- [X] Apply roof, try using hot glue
- [X] Add floor mats
- [X] Move in furniture
- [X] Find spot for file cabinet/smoothing chamber
- [X] Connect solar
- [X] Setup Bluetti power station with extension cords
- [X] Setup printers
- [X] Try moving dryer tumbler into tent
- [ ] Add humidity sensor.
- [X] Get drywall sander working with drill
- [X] Sand build plates
- [ ] Level all extruders

** DONE Install new polycarbonate build plate
SCHEDULED: <2022-11-17 Thu>
** DONE Fix kossel 5
SCHEDULED: <2022-10-15 Sat>
SCHEDULED: <2022-12-12 Mon>
** DONE Redo K4 build plate
SCHEDULED: <2023-01-24 Tue>
* House Keeping
** DONE Clean tables
SCHEDULED: <2023-02-20 Mon>
** DONE Take out trash
SCHEDULED: <2023-02-20 Mon>
** DONE cleanup backyard
SCHEDULED: <2022-11-28 Mon>
** DONE Move solar panels
SCHEDULED: <2022-11-28 Mon>
** DONE Cleanup shop
SCHEDULED: <2022-11-28 Mon>
* Manifold-3d Project
- [X] Include manifold js file in index.html
- [ ] Write wrapper for manifold js functions
- [ ] Include manifold namespace in sci
- [ ] Implement example in cljs
* Job Hunt
** TODO Create shopify website to showoff my work
** TODO Work on resume
** TODO Search for addative manufaturing jobs in San Diego
** TODO Apply for one robotic job a day.
** TODO Look for process automation jobs in manufacturing.
** TODO Open source and document more of your work.
